actuator/old/actuatorSvarnas/flow_cht/flow_laminar/constant/dielectric/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/heater";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    energySource
    {
        type            scalarSemiImplicitSource;
        // timeStart       0;
        // duration        30.0;
        selectionMode   cellZone;
        cellZone        heatSource;
        volumeMode      specific;

        injectionRateSuSp
        {
            h          (1.77e7 0); // W/m^3 == kg/m/s^3
        }
    }
}

// ************************************************************************* //
